/***************************************************************************************
									声明
本项目代码仅供个人学习使用，可以自由移植修改，但必须保留此声明信息。移植过程中出现其他不可
估量的BUG，修远智控不负任何责任。请勿商用！

程序版本号：	2.5
日期：			2017-5-1
作者：			东方萧雨、小马哥
版权所有：		修远智控N0.1实验室
****************************************************************************************/
#include "function_it.h"
#include "global.h"
#include "mpu_dmp_useapi.h"


//========================全局变量定义区=======================================
extern TaskMask_s TaskMask;


/*******************************************************************
MPU6050的INT脚对应的EXTI中断处理函数
********************************************************************/
void EXTI15_10_IRQHandler(void)
{
	//将new_gyro标志量置位
	gyro_data_ready_cb();
	
	//将PID运算及控制任务开启
	TaskMask.angleDataReady = 1;
	
	//清除EXTI中断标志
	EXTI_ClearFlag(EXTI_Line15);
}



//定时器2中断处理函数,用于判断飞机和遥控器连接是否中断
void TIM2_IRQHandler(void)
{
	if(TIM_GetITStatus(TIM2,TIM_IT_Update)==SET){
		
		TaskMask.checkSingle = 1;
		
		TIM_ClearITPendingBit(TIM2,TIM_IT_Update);
	}
}


/*****************************************************************************************
NRF的IRQ引脚对应的EXTI中断处理函数，用于指示无线数据的收发情况
*******************************************************************************************/
void EXTI0_IRQHandler(void)
{
	TaskMask.nrfDataReady = 1;
	
	EXTI_ClearITPendingBit(EXTI_Line0);
}



